HW2/Q2-Benchmark-Comparison/testbench-results/linux.txt
bagheri-timarchi@debian:~$ sysbench cpu --threads=4 --cpu-max-prime=2000000 --percentile=99 run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Prime numbers limit: 2000000

Initializing worker threads...

Threads started!

CPU speed:
    events per second:     8.40

General statistics:
    total time:                          10.4753s
    total number of events:              88

Latency (ms):
         min:                                  474.81
         avg:                                  475.91
         max:                                  481.00
         99th percentile:                      484.44
         sum:                                41879.82

Threads fairness:
    events (avg/stddev):           22.0000/0.00
    execution time (avg/stddev):   10.4700/0.00

bagheri-timarchi@debian:~$ sysbench memory --memory-total-size=20G --memory-access-mode=rnd run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 20480MiB
  operation: write
  scope: global

Initializing worker threads...

Threads started!

Total operations: 20971520 (3195827.35 per second)

20480.00 MiB transferred (3120.93 MiB/sec)


General statistics:
    total time:                          6.5607s
    total number of events:              20971520

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    0.04
         95th percentile:                        0.00
         sum:                                 5132.24

Threads fairness:
    events (avg/stddev):           20971520.0000/0.00
    execution time (avg/stddev):   5.1322/0.00

bagheri-timarchi@debian:~$ sysbench fileio --file-total-size=4G prepare  # Creates files
sysbench fileio --file-total-size=4G --file-test-mode=seqwr --percentile=99 run
sysbench fileio --file-total-size=4G cleanup  # Removes files
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

128 files, 32768Kb each, 4096Mb total
Creating files for the test...
Extra file open flags: (none)
Creating file test_file.0
Creating file test_file.1
Creating file test_file.2
Creating file test_file.3
Creating file test_file.4
Creating file test_file.5
Creating file test_file.6
Creating file test_file.7
Creating file test_file.8
Creating file test_file.9
Creating file test_file.10
Creating file test_file.11
Creating file test_file.12
Creating file test_file.13
Creating file test_file.14
Creating file test_file.15
Creating file test_file.16
Creating file test_file.17
Creating file test_file.18
Creating file test_file.19
Creating file test_file.20
Creating file test_file.21
Creating file test_file.22
Creating file test_file.23
Creating file test_file.24
Creating file test_file.25
Creating file test_file.26
Creating file test_file.27
Creating file test_file.28
Creating file test_file.29
Creating file test_file.30
Creating file test_file.31
Creating file test_file.32
Creating file test_file.33
Creating file test_file.34
Creating file test_file.35
Creating file test_file.36
Creating file test_file.37
Creating file test_file.38
Creating file test_file.39
Creating file test_file.40
Creating file test_file.41
Creating file test_file.42
Creating file test_file.43
Creating file test_file.44
Creating file test_file.45
Creating file test_file.46
Creating file test_file.47
Creating file test_file.48
Creating file test_file.49
Creating file test_file.50
Creating file test_file.51
Creating file test_file.52
Creating file test_file.53
Creating file test_file.54
Creating file test_file.55
Creating file test_file.56
Creating file test_file.57
Creating file test_file.58
Creating file test_file.59
Creating file test_file.60
Creating file test_file.61
Creating file test_file.62
Creating file test_file.63
Creating file test_file.64
Creating file test_file.65
Creating file test_file.66
Creating file test_file.67
Creating file test_file.68
Creating file test_file.69
Creating file test_file.70
Creating file test_file.71
Creating file test_file.72
Creating file test_file.73
Creating file test_file.74
Creating file test_file.75
Creating file test_file.76
Creating file test_file.77
Creating file test_file.78
Creating file test_file.79
Creating file test_file.80
Creating file test_file.81
Creating file test_file.82
Creating file test_file.83
Creating file test_file.84
Creating file test_file.85
Creating file test_file.86
Creating file test_file.87
Creating file test_file.88
Creating file test_file.89
Creating file test_file.90
Creating file test_file.91
Creating file test_file.92
Creating file test_file.93
Creating file test_file.94
Creating file test_file.95
Creating file test_file.96
Creating file test_file.97
Creating file test_file.98
Creating file test_file.99
Creating file test_file.100
Creating file test_file.101
Creating file test_file.102
Creating file test_file.103
Creating file test_file.104
Creating file test_file.105
Creating file test_file.106
Creating file test_file.107
Creating file test_file.108
Creating file test_file.109
Creating file test_file.110
Creating file test_file.111
Creating file test_file.112
Creating file test_file.113
Creating file test_file.114
Creating file test_file.115
Creating file test_file.116
Creating file test_file.117
Creating file test_file.118
Creating file test_file.119
Creating file test_file.120
Creating file test_file.121
Creating file test_file.122
Creating file test_file.123
Creating file test_file.124
Creating file test_file.125
Creating file test_file.126
Creating file test_file.127
4294967296 bytes written in 5.18 seconds (790.45 MiB/sec).
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32MiB each
4GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1141.46
    fsyncs/s:                     1470.70

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               17.84

General statistics:
    total time:                          10.0719s
    total number of events:              26189

Latency (ms):
         min:                                    0.01
         avg:                                    0.38
         max:                                   20.16
         99th percentile:                        0.65
         sum:                                 9975.76

Threads fairness:
    events (avg/stddev):           26189.0000/0.00
    execution time (avg/stddev):   9.9758/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Removing test files...
bagheri-timarchi@debian:~$ ^C
bagheri-timarchi@debian:~$